import math
a = int(input())
print(math.isqrt(a))

"""Напишите программу, которая принимает целое неотрицательное число от пользователя и выводит его целочисленный квадратный корень."""