import math
a = int(input())
b = int(input())
gcd = math.gcd(a, b)
print(gcd)


"""Напишите программу, которая принимает два целых числа от пользователя и выводит их наибольший общий делитель (НОД)."""