import math
a = float(input())
print(math.ceil(a))
print(math.floor(a))

"""Напишите программу, которая принимает стоимость товара с копейками(float) и выводит её округлённое вверх и вниз."""