import math
r = int(input())
s = math.pi * (r**2)
print(round(s, 2))


"""Лена занимается рисованием и хочет рассчитать площадь круга для своего проекта, зная радиус.

Напишите программу, которая принимает радиус круга от пользователя и выводит его площадь, используя формулу:"""