n = int(input())
num = list(range(n + 1))
print(num[1:])

"""На вход программе подаётся одно число 
n.Напишите программу, которая выводит список [1, 2, 3, ..., n].

Формат входных данных
На вход программе подаётся одно натуральное число.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи."""