import math 
a = int(input())
b = int(input())
c = a**2 + b**2
print(math.sqrt(c))

"""Наташа изучает основы геометрии и хочет написать программу, которая поможет ей вычислять длину гипотенузы прямоугольного треугольника по заданным катетам.

Напишите программу, которая принимает длины двух катетов прямоугольного треугольника и выводит длину его гипотенузы."""