import math
a = int(input())
print(math.log(a))
print(math.log10(a))
print(math.exp(math.log(a)))

"""Напишите программу, которая выполняет следующие действия:

Принимает положительное число от пользователя.
Вычисляет натуральный логарифм этого числа.
Вычисляет десятичный логарифм этого числа.
Вычисляет экспоненту полученного натурального логарифма.
Выводит все три результата пользователю."""