import math
t_max = int(input())
t_min = int(input())
t =  t_max - t_min
print(math.fabs(t)) 


"""необходимо вычислять абсолютную разницу между максимальной и минимальной температурой дня.

Напишите программу, которая принимает максимальную и минимальную температуры за день и выводит их абсолютную разницу."""